{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "Opt_Inception_ResNet", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 500], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "batch_input_shape": [null, 500], "dtype": "float32", "target_shape": [500, 1]}, "name": "reshape", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "batch_input_shape": [null, 500, 1], "dtype": "float32", "filters": 115, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation", "inbound_nodes": [[["conv1d", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "dtype": "float32", "filters": 115, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_1", "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "dtype": "float32", "filters": 115, "kernel_size": [7], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_3", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_3", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_4", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["conv1d_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_5", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_5", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_6", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_6", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_4", "inbound_nodes": [[["conv1d_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_7", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [6], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_7", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_7", "inbound_nodes": [[["conv1d_7", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_8", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_8", "inbound_nodes": [[["max_pooling1d", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_8", "inbound_nodes": [[["conv1d_8", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_9", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_9", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_5", "inbound_nodes": [[["conv1d_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_9", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_1", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_10", "trainable": true, "dtype": "float32", "filters": 46, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_10", "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_10", "inbound_nodes": [[["conv1d_10", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_11", "trainable": true, "dtype": "float32", "filters": 46, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_6", "inbound_nodes": [[["conv1d_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_11", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l0_hl0_Conv1D_r2_1", "trainable": true, "dtype": "float32", "filters": 41, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l0_hl0_Conv1D_r2_1", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "inception_l0_hl0_MaxPool_r4_1", "trainable": true, "dtype": "float32", "strides": [1], "pool_size": [3], "padding": "same", "data_format": "channels_last"}, "name": "inception_l0_hl0_MaxPool_r4_1", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l0_hl0_Conv1D_r1_1", "trainable": true, "dtype": "float32", "filters": 22, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l0_hl0_Conv1D_r1_1", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l0_hl0_Conv1D_r2_2", "trainable": true, "dtype": "float32", "filters": 71, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l0_hl0_Conv1D_r2_2", "inbound_nodes": [[["inception_l0_hl0_Conv1D_r2_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l0_hl0_Conv1D_r4_1", "trainable": true, "dtype": "float32", "filters": 15, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l0_hl0_Conv1D_r4_1", "inbound_nodes": [[["inception_l0_hl0_MaxPool_r4_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "inception_l0_hl0_out", "trainable": true, "dtype": "float32", "axis": -1}, "name": "inception_l0_hl0_out", "inbound_nodes": [[["inception_l0_hl0_Conv1D_r1_1", 0, 0, {}], ["inception_l0_hl0_Conv1D_r2_2", 0, 0, {}], ["inception_l0_hl0_Conv1D_r4_1", 0, 0, {}], ["inception_l0_hl0_Conv1D_r4_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l1_hl0_Conv1D_r2_1", "trainable": true, "dtype": "float32", "filters": 11, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l1_hl0_Conv1D_r2_1", "inbound_nodes": [[["inception_l0_hl0_out", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "inception_l1_hl0_MaxPool_r4_1", "trainable": true, "dtype": "float32", "strides": [1], "pool_size": [3], "padding": "same", "data_format": "channels_last"}, "name": "inception_l1_hl0_MaxPool_r4_1", "inbound_nodes": [[["inception_l0_hl0_out", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l1_hl0_Conv1D_r1_1", "trainable": true, "dtype": "float32", "filters": 7, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l1_hl0_Conv1D_r1_1", "inbound_nodes": [[["inception_l0_hl0_out", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l1_hl0_Conv1D_r2_2", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l1_hl0_Conv1D_r2_2", "inbound_nodes": [[["inception_l1_hl0_Conv1D_r2_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l1_hl0_Conv1D_r4_1", "trainable": true, "dtype": "float32", "filters": 11, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l1_hl0_Conv1D_r4_1", "inbound_nodes": [[["inception_l1_hl0_MaxPool_r4_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "inception_l1_hl0_out", "trainable": true, "dtype": "float32", "axis": -1}, "name": "inception_l1_hl0_out", "inbound_nodes": [[["inception_l1_hl0_Conv1D_r1_1", 0, 0, {}], ["inception_l1_hl0_Conv1D_r2_2", 0, 0, {}], ["inception_l1_hl0_Conv1D_r4_1", 0, 0, {}], ["inception_l1_hl0_Conv1D_r4_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l1_hl1_Conv1D_r2_1", "trainable": true, "dtype": "float32", "filters": 9, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l1_hl1_Conv1D_r2_1", "inbound_nodes": [[["inception_l1_hl0_out", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "inception_l1_hl1_MaxPool_r4_1", "trainable": true, "dtype": "float32", "strides": [1], "pool_size": [3], "padding": "same", "data_format": "channels_last"}, "name": "inception_l1_hl1_MaxPool_r4_1", "inbound_nodes": [[["inception_l1_hl0_out", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l1_hl1_Conv1D_r1_1", "trainable": true, "dtype": "float32", "filters": 30, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l1_hl1_Conv1D_r1_1", "inbound_nodes": [[["inception_l1_hl0_out", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l1_hl1_Conv1D_r2_2", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l1_hl1_Conv1D_r2_2", "inbound_nodes": [[["inception_l1_hl1_Conv1D_r2_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l1_hl1_Conv1D_r4_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l1_hl1_Conv1D_r4_1", "inbound_nodes": [[["inception_l1_hl1_MaxPool_r4_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "inception_l1_hl1_out", "trainable": true, "dtype": "float32", "axis": -1}, "name": "inception_l1_hl1_out", "inbound_nodes": [[["inception_l1_hl1_Conv1D_r1_1", 0, 0, {}], ["inception_l1_hl1_Conv1D_r2_2", 0, 0, {}], ["inception_l1_hl1_Conv1D_r4_1", 0, 0, {}], ["inception_l1_hl1_Conv1D_r4_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l2_hl0_Conv1D_r2_1", "trainable": true, "dtype": "float32", "filters": 110, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l2_hl0_Conv1D_r2_1", "inbound_nodes": [[["inception_l1_hl1_out", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "inception_l2_hl0_MaxPool_r4_1", "trainable": true, "dtype": "float32", "strides": [1], "pool_size": [3], "padding": "same", "data_format": "channels_last"}, "name": "inception_l2_hl0_MaxPool_r4_1", "inbound_nodes": [[["inception_l1_hl1_out", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l2_hl0_Conv1D_r1_1", "trainable": true, "dtype": "float32", "filters": 11, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l2_hl0_Conv1D_r1_1", "inbound_nodes": [[["inception_l1_hl1_out", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l2_hl0_Conv1D_r2_2", "trainable": true, "dtype": "float32", "filters": 17, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l2_hl0_Conv1D_r2_2", "inbound_nodes": [[["inception_l2_hl0_Conv1D_r2_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l2_hl0_Conv1D_r4_1", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l2_hl0_Conv1D_r4_1", "inbound_nodes": [[["inception_l2_hl0_MaxPool_r4_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "inception_l2_hl0_out", "trainable": true, "dtype": "float32", "axis": -1}, "name": "inception_l2_hl0_out", "inbound_nodes": [[["inception_l2_hl0_Conv1D_r1_1", 0, 0, {}], ["inception_l2_hl0_Conv1D_r2_2", 0, 0, {}], ["inception_l2_hl0_Conv1D_r4_1", 0, 0, {}], ["inception_l2_hl0_Conv1D_r4_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "ResNet_l3_hl0_mainpath_Conv2D_1x1_0", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "ResNet_l3_hl0_mainpath_Conv2D_1x1_0", "inbound_nodes": [[["inception_l2_hl0_out", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ResNet_l3_hl0_mainpath_BatchNorm_0", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ResNet_l3_hl0_mainpath_BatchNorm_0", "inbound_nodes": [[["ResNet_l3_hl0_mainpath_Conv2D_1x1_0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ResNet_l3_hl0_mainpath_Activation_0", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ResNet_l3_hl0_mainpath_Activation_0", "inbound_nodes": [[["ResNet_l3_hl0_mainpath_BatchNorm_0", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "ResNet_l3_hl0_mainpath_Conv2D_dilated_2", "trainable": true, "dtype": "float32", "filters": 2, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [2], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "ResNet_l3_hl0_mainpath_Conv2D_dilated_2", "inbound_nodes": [[["ResNet_l3_hl0_mainpath_Activation_0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ResNet_l3_hl0_mainpath_BatchNorm_2", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ResNet_l3_hl0_mainpath_BatchNorm_2", "inbound_nodes": [[["ResNet_l3_hl0_mainpath_Conv2D_dilated_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ResNet_l3_hl0_mainpath_Activation_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ResNet_l3_hl0_mainpath_Activation_2", "inbound_nodes": [[["ResNet_l3_hl0_mainpath_BatchNorm_2", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "ResNet_l3_hl0_mainpath_Conv2D_1x1_3", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "ResNet_l3_hl0_mainpath_Conv2D_1x1_3", "inbound_nodes": [[["ResNet_l3_hl0_mainpath_Activation_2", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "ResNet_l3_hl0_shortpath_Conv2D", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "ResNet_l3_hl0_shortpath_Conv2D", "inbound_nodes": [[["inception_l2_hl0_out", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ResNet_l3_hl0_mainpath_BatchNorm_3", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ResNet_l3_hl0_mainpath_BatchNorm_3", "inbound_nodes": [[["ResNet_l3_hl0_mainpath_Conv2D_1x1_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ResNet_l3_hl0_shortpath_BatchNorm", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ResNet_l3_hl0_shortpath_BatchNorm", "inbound_nodes": [[["ResNet_l3_hl0_shortpath_Conv2D", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ResNet_l3_hl0_mainpath_Activation_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ResNet_l3_hl0_mainpath_Activation_3", "inbound_nodes": [[["ResNet_l3_hl0_mainpath_BatchNorm_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ResNet_l3_hl0_shortpath_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ResNet_l3_hl0_shortpath_Activation", "inbound_nodes": [[["ResNet_l3_hl0_shortpath_BatchNorm", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "ResNet_l3_hl0_Add", "trainable": true, "dtype": "float32"}, "name": "ResNet_l3_hl0_Add", "inbound_nodes": [[["ResNet_l3_hl0_mainpath_Activation_3", 0, 0, {}], ["ResNet_l3_hl0_shortpath_Activation", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ResNet_l3_hl0_join_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ResNet_l3_hl0_join_Activation", "inbound_nodes": [[["ResNet_l3_hl0_Add", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "ResNet_l3_hl1_mainpath_Conv2D_1x1_0", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "ResNet_l3_hl1_mainpath_Conv2D_1x1_0", "inbound_nodes": [[["ResNet_l3_hl0_join_Activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ResNet_l3_hl1_mainpath_BatchNorm_0", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ResNet_l3_hl1_mainpath_BatchNorm_0", "inbound_nodes": [[["ResNet_l3_hl1_mainpath_Conv2D_1x1_0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ResNet_l3_hl1_mainpath_Activation_0", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ResNet_l3_hl1_mainpath_Activation_0", "inbound_nodes": [[["ResNet_l3_hl1_mainpath_BatchNorm_0", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "ResNet_l3_hl1_mainpath_Conv2D_dilated_2", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [4], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "ResNet_l3_hl1_mainpath_Conv2D_dilated_2", "inbound_nodes": [[["ResNet_l3_hl1_mainpath_Activation_0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ResNet_l3_hl1_mainpath_BatchNorm_2", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ResNet_l3_hl1_mainpath_BatchNorm_2", "inbound_nodes": [[["ResNet_l3_hl1_mainpath_Conv2D_dilated_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ResNet_l3_hl1_mainpath_Activation_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ResNet_l3_hl1_mainpath_Activation_2", "inbound_nodes": [[["ResNet_l3_hl1_mainpath_BatchNorm_2", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "ResNet_l3_hl1_mainpath_Conv2D_1x1_3", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "ResNet_l3_hl1_mainpath_Conv2D_1x1_3", "inbound_nodes": [[["ResNet_l3_hl1_mainpath_Activation_2", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "ResNet_l3_hl1_shortpath_Conv2D", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "ResNet_l3_hl1_shortpath_Conv2D", "inbound_nodes": [[["ResNet_l3_hl0_join_Activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ResNet_l3_hl1_mainpath_BatchNorm_3", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ResNet_l3_hl1_mainpath_BatchNorm_3", "inbound_nodes": [[["ResNet_l3_hl1_mainpath_Conv2D_1x1_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "ResNet_l3_hl1_shortpath_BatchNorm", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "ResNet_l3_hl1_shortpath_BatchNorm", "inbound_nodes": [[["ResNet_l3_hl1_shortpath_Conv2D", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ResNet_l3_hl1_mainpath_Activation_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ResNet_l3_hl1_mainpath_Activation_3", "inbound_nodes": [[["ResNet_l3_hl1_mainpath_BatchNorm_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ResNet_l3_hl1_shortpath_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ResNet_l3_hl1_shortpath_Activation", "inbound_nodes": [[["ResNet_l3_hl1_shortpath_BatchNorm", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "ResNet_l3_hl1_Add", "trainable": true, "dtype": "float32"}, "name": "ResNet_l3_hl1_Add", "inbound_nodes": [[["ResNet_l3_hl1_mainpath_Activation_3", 0, 0, {}], ["ResNet_l3_hl1_shortpath_Activation", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "ResNet_l3_hl1_join_Activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "ResNet_l3_hl1_join_Activation", "inbound_nodes": [[["ResNet_l3_hl1_Add", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l4_hl0_Conv1D_r2_1", "trainable": true, "dtype": "float32", "filters": 61, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l4_hl0_Conv1D_r2_1", "inbound_nodes": [[["ResNet_l3_hl1_join_Activation", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "inception_l4_hl0_MaxPool_r4_1", "trainable": true, "dtype": "float32", "strides": [1], "pool_size": [3], "padding": "same", "data_format": "channels_last"}, "name": "inception_l4_hl0_MaxPool_r4_1", "inbound_nodes": [[["ResNet_l3_hl1_join_Activation", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l4_hl0_Conv1D_r1_1", "trainable": true, "dtype": "float32", "filters": 5, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l4_hl0_Conv1D_r1_1", "inbound_nodes": [[["ResNet_l3_hl1_join_Activation", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l4_hl0_Conv1D_r2_2", "trainable": true, "dtype": "float32", "filters": 93, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l4_hl0_Conv1D_r2_2", "inbound_nodes": [[["inception_l4_hl0_Conv1D_r2_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l4_hl0_Conv1D_r4_1", "trainable": true, "dtype": "float32", "filters": 17, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l4_hl0_Conv1D_r4_1", "inbound_nodes": [[["inception_l4_hl0_MaxPool_r4_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "inception_l4_hl0_out", "trainable": true, "dtype": "float32", "axis": -1}, "name": "inception_l4_hl0_out", "inbound_nodes": [[["inception_l4_hl0_Conv1D_r1_1", 0, 0, {}], ["inception_l4_hl0_Conv1D_r2_2", 0, 0, {}], ["inception_l4_hl0_Conv1D_r4_1", 0, 0, {}], ["inception_l4_hl0_Conv1D_r4_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l4_hl1_Conv1D_r2_1", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l4_hl1_Conv1D_r2_1", "inbound_nodes": [[["inception_l4_hl0_out", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "inception_l4_hl1_MaxPool_r4_1", "trainable": true, "dtype": "float32", "strides": [1], "pool_size": [3], "padding": "same", "data_format": "channels_last"}, "name": "inception_l4_hl1_MaxPool_r4_1", "inbound_nodes": [[["inception_l4_hl0_out", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l4_hl1_Conv1D_r1_1", "trainable": true, "dtype": "float32", "filters": 36, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l4_hl1_Conv1D_r1_1", "inbound_nodes": [[["inception_l4_hl0_out", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l4_hl1_Conv1D_r2_2", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l4_hl1_Conv1D_r2_2", "inbound_nodes": [[["inception_l4_hl1_Conv1D_r2_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "inception_l4_hl1_Conv1D_r4_1", "trainable": true, "dtype": "float32", "filters": 106, "kernel_size": [1], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_l4_hl1_Conv1D_r4_1", "inbound_nodes": [[["inception_l4_hl1_MaxPool_r4_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "inception_l4_hl1_out", "trainable": true, "dtype": "float32", "axis": -1}, "name": "inception_l4_hl1_out", "inbound_nodes": [[["inception_l4_hl1_Conv1D_r1_1", 0, 0, {}], ["inception_l4_hl1_Conv1D_r2_2", 0, 0, {}], ["inception_l4_hl1_Conv1D_r4_1", 0, 0, {}], ["inception_l4_hl1_Conv1D_r4_1", 0, 0, {}]]]}, {"class_name": "AveragePooling1D", "config": {"name": "average_pooling1d", "trainable": true, "dtype": "float32", "strides": [1], 