{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "v5_1_Custom-multiInputs", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 500], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_10"}, "name": "input_10", "inbound_nodes": []}, {"class_name": "Reshape", "config": {"name": "reshape_13", "trainable": true, "batch_input_shape": [null, 500], "dtype": "float32", "target_shape": [500, 1]}, "name": "reshape_13", "inbound_nodes": [[["input_10", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_16", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_16", "op": "StridedSlice", "input": ["reshape_13/Reshape", "strided_slice_16/begin", "strided_slice_16/end", "strided_slice_16/strides"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "5"}, "end_mask": {"i": "5"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}}}, "constants": {"1": [0, 35, 0], "2": [0, 43, 0], "3": [1, 1, 1]}}, "name": "tf_op_layer_strided_slice_16", "inbound_nodes": [[["reshape_13", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_18", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_18", "op": "StridedSlice", "input": ["reshape_13/Reshape", "strided_slice_18/begin", "strided_slice_18/end", "strided_slice_18/strides"], "attr": {"ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "5"}, "begin_mask": {"i": "5"}, "shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0, 67, 0], "2": [0, 75, 0], "3": [1, 1, 1]}}, "name": "tf_op_layer_strided_slice_18", "inbound_nodes": [[["reshape_13", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_17", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_17", "op": "StridedSlice", "input": ["reshape_13/Reshape", "strided_slice_17/begin", "strided_slice_17/end", "strided_slice_17/strides"], "attr": {"ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "5"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "5"}}}, "constants": {"1": [0, 33, 0], "2": [0, 41, 0], "3": [1, 1, 1]}}, "name": "tf_op_layer_strided_slice_17", "inbound_nodes": [[["reshape_13", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_19", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_19", "op": "StridedSlice", "input": ["reshape_13/Reshape", "strided_slice_19/begin", "strided_slice_19/end", "strided_slice_19/strides"], "attr": {"end_mask": {"i": "5"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "5"}}}, "constants": {"1": [0, 49, 0], "2": [0, 57, 0], "3": [1, 1, 1]}}, "name": "tf_op_layer_strided_slice_19", "inbound_nodes": [[["reshape_13", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mean_16", "trainable": true, "dtype": "float32", "node_def": {"name": "mean_16", "op": "Mean", "input": ["strided_slice_16", "mean_16/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, "constants": {"1": [1]}}, "name": "tf_op_layer_mean_16", "inbound_nodes": [[["tf_op_layer_strided_slice_16", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mean_18", "trainable": true, "dtype": "float32", "node_def": {"name": "mean_18", "op": "Mean", "input": ["strided_slice_18", "mean_18/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [1]}}, "name": "tf_op_layer_mean_18", "inbound_nodes": [[["tf_op_layer_strided_slice_18", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mean_17", "trainable": true, "dtype": "float32", "node_def": {"name": "mean_17", "op": "Mean", "input": ["strided_slice_17", "mean_17/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, "constants": {"1": [1]}}, "name": "tf_op_layer_mean_17", "inbound_nodes": [[["tf_op_layer_strided_slice_17", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "mean_19", "trainable": true, "dtype": "float32", "node_def": {"name": "mean_19", "op": "Mean", "input": ["strided_slice_19", "mean_19/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [1]}}, "name": "tf_op_layer_mean_19", "inbound_nodes": [[["tf_op_layer_strided_slice_19", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "StopGradient_16", "trainable": true, "dtype": "float32", "node_def": {"name": "StopGradient_16", "op": "StopGradient", "input": ["mean_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_StopGradient_16", "inbound_nodes": [[["tf_op_layer_mean_16", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "StopGradient_18", "trainable": true, "dtype": "float32", "node_def": {"name": "StopGradient_18", "op": "StopGradient", "input": ["mean_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_StopGradient_18", "inbound_nodes": [[["tf_op_layer_mean_18", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "StopGradient_17", "trainable": true, "dtype": "float32", "node_def": {"name": "StopGradient_17", "op": "StopGradient", "input": ["mean_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_StopGradient_17", "inbound_nodes": [[["tf_op_layer_mean_17", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "StopGradient_19", "trainable": true, "dtype": "float32", "node_def": {"name": "StopGradient_19", "op": "StopGradient", "input": ["mean_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_StopGradient_19", "inbound_nodes": [[["tf_op_layer_mean_19", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "SquaredDifference_16", "trainable": true, "dtype": "float32", "node_def": {"name": "SquaredDifference_16", "op": "SquaredDifference", "input": ["strided_slice_16", "StopGradient_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_SquaredDifference_16", "inbound_nodes": [[["tf_op_layer_strided_slice_16", 0, 0, {}], ["tf_op_layer_StopGradient_16", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "SquaredDifference_18", "trainable": true, "dtype": "float32", "node_def": {"name": "SquaredDifference_18", "op": "SquaredDifference", "input": ["strided_slice_18", "StopGradient_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_SquaredDifference_18", "inbound_nodes": [[["tf_op_layer_strided_slice_18", 0, 0, {}], ["tf_op_layer_StopGradient_18", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "SquaredDifference_17", "trainable": true, "dtype": "float32", "node_def": {"name": "SquaredDifference_17", "op": "SquaredDifference", "input": ["strided_slice_17", "StopGradient_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_SquaredDifference_17", "inbound_nodes": [[["tf_op_layer_strided_slice_17", 0, 0, {}], ["tf_op_layer_StopGradient_17", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "SquaredDifference_19", "trainable": true, "dtype": "float32", "node_def": {"name": "SquaredDifference_19", "op": "SquaredDifference", "input": ["strided_slice_19", "StopGradient_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_SquaredDifference_19", "inbound_nodes": [[["tf_op_layer_strided_slice_19", 0, 0, {}], ["tf_op_layer_StopGradient_19", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "variance_16", "trainable": true, "dtype": "float32", "node_def": {"name": "variance_16", "op": "Mean", "input": ["SquaredDifference_16", "variance_16/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, "constants": {"1": [1]}}, "name": "tf_op_layer_variance_16", "inbound_nodes": [[["tf_op_layer_SquaredDifference_16", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "variance_18", "trainable": true, "dtype": "float32", "node_def": {"name": "variance_18", "op": "Mean", "input": ["SquaredDifference_18", "variance_18/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [1]}}, "name": "tf_op_layer_variance_18", "inbound_nodes": [[["tf_op_layer_SquaredDifference_18", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "variance_17", "trainable": true, "dtype": "float32", "node_def": {"name": "variance_17", "op": "Mean", "input": ["SquaredDifference_17", "variance_17/reduction_indices"], "attr": {"keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, "constants": {"1": [1]}}, "name": "tf_op_layer_variance_17", "inbound_nodes": [[["tf_op_layer_SquaredDifference_17", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "variance_19", "trainable": true, "dtype": "float32", "node_def": {"name": "variance_19", "op": "Mean", "input": ["SquaredDifference_19", "variance_19/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, "constants": {"1": [1]}}, "name": "tf_op_layer_variance_19", "inbound_nodes": [[["tf_op_layer_SquaredDifference_19", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Squeeze_33", "trainable": true, "dtype": "float32", "node_def": {"name": "Squeeze_33", "op": "Squeeze", "input": ["variance_16"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, "constants": {}}, "name": "tf_op_layer_Squeeze_33", "inbound_nodes": [[["tf_op_layer_variance_16", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Squeeze_32", "trainable": true, "dtype": "float32", "node_def": {"name": "Squeeze_32", "op": "Squeeze", "input": ["mean_16"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, "constants": {}}, "name": "tf_op_layer_Squeeze_32", "inbound_nodes": [[["tf_op_layer_mean_16", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Squeeze_37", "trainable": true, "dtype": "float32", "node_def": {"name": "Squeeze_37", "op": "Squeeze", "input": ["variance_18"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, "constants": {}}, "name": "tf_op_layer_Squeeze_37", "inbound_nodes": [[["tf_op_layer_variance_18", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Squeeze_36", "trainable": true, "dtype": "float32", "node_def": {"name": "Squeeze_36", "op": "Squeeze", "input": ["mean_18"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, "constants": {}}, "name": "tf_op_layer_Squeeze_36", "inbound_nodes": [[["tf_op_layer_mean_18", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Squeeze_35", "trainable": true, "dtype": "float32", "node_def": {"name": "Squeeze_35", "op": "Squeeze", "input": ["variance_17"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Squeeze_35", "inbound_nodes": [[["tf_op_layer_variance_17", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Squeeze_34", "trainable": true, "dtype": "float32", "node_def": {"name": "Squeeze_34", "op": "Squeeze", "input": ["mean_17"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Squeeze_34", "inbound_nodes": [[["tf_op_layer_mean_17", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Squeeze_39", "trainable": true, "dtype": "float32", "node_def": {"name": "Squeeze_39", "op": "Squeeze", "input": ["variance_19"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Squeeze_39", "inbound_nodes": [[["tf_op_layer_variance_19", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Squeeze_38", "trainable": true, "dtype": "float32", "node_def": {"name": "Squeeze_38", "op": "Squeeze", "input": ["mean_19"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Squeeze_38", "inbound_nodes": [[["tf_op_layer_mean_19", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_32", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_32", "op": "Reshape", "input": ["Squeeze_33", "Reshape_32/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, "constants": {"1": [-1, 1, 1]}}, "name": "tf_op_layer_Reshape_32", "inbound_nodes": [[["tf_op_layer_Squeeze_33", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_33", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_33", "op": "Reshape", "input": ["Squeeze_32", "Reshape_33/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, "constants": {"1": [-1, 1, 1]}}, "name": "tf_op_layer_Reshape_33", "inbound_nodes": [[["tf_op_layer_Squeeze_32", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_36", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_36", "op": "Reshape", "input": ["Squeeze_37", "Reshape_36/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, "constants": {"1": [-1, 1, 1]}}, "name": "tf_op_layer_Reshape_36", "inbound_nodes": [[["tf_op_layer_Squeeze_37", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_37", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_37", "op": "Reshape", "input": ["Squeeze_36", "Reshape_37/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, "constants": {"1": [-1, 1, 1]}}, "name": "tf_op_layer_Reshape_37", "inbound_nodes": [[["tf_op_layer_Squeeze_36", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_34", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_34", "op": "Reshape", "input": ["Squeeze_35", "Reshape_34/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, "constants": {"1": [-1, 1, 1]}}, "name": "tf_op_layer_Reshape_34", "inbound_nodes": [[["tf_op_layer_Squeeze_35", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_35", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_35", "op": "Reshape", "input": ["Squeeze_34", "Reshape_35/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [-1, 1, 1]}}, "name": "tf_op_layer_Reshape_35", "inbound_nodes": [[["tf_op_layer_Squeeze_34", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_38", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_38", "op": "Reshape", "input": ["Squeeze_39", "Reshape_38/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [-1, 1, 1]}}, "name": "tf_op_layer_Reshape_38", "inbound_nodes": [[["tf_op_layer_Squeeze_39", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape_39", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape_39", "op": "Reshape", "input": ["Squeeze_38", "Reshape_39/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [-1, 1, 1]}}, "name": "tf_op_layer_Reshape_39", "inbound_nodes": [[["tf_op_layer_Squeeze_38", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sub_16", "trainable": true, "dtype": "float32", "node_def": {"name": "Sub_16", "op": "Sub", "input": ["strided_slice_16", "Reshape_32"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sub_16", "inbound_nodes": [[["tf_op_layer_strided_slice_16", 0, 0, {}], ["tf_op_layer_Reshape_32", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_16", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_16", "op": "AddV2", "input": ["Reshape_33", "AddV2_16/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_AddV2_16", "inbound_nodes": [[["tf_op_layer_Reshape_33", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sub_18", "trainable": true, "dtype": "float32", "node_def": {"name": "Sub_18", "op": "Sub", "input": ["strided_slice_18", "Reshape_36"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sub_18", "inbound_nodes": [[["tf_op_layer_strided_slice_18", 0, 0, {}], ["tf_op_layer_Reshape_36", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_18", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_18", "op": "AddV2", "input": ["Reshape_37", "AddV2_18/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_AddV2_18", "inbound_nodes": [[["tf_op_layer_Reshape_37", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sub_17", "trainable": true, "dtype": "float32", "node_def": {"name": "Sub_17", "op": "Sub", "input": ["strided_slice_17", "Reshape_34"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sub_17", "inbound_nodes": [[["tf_op_layer_strided_slice_17", 0, 0, {}], ["tf_op_layer_Reshape_34", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_17", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_17", "op": "AddV2", "input": ["Reshape_35", "AddV2_17/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_AddV2_17", "inbound_nodes": [[["tf_op_layer_Reshape_35", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sub_19", "trainable": true, "dtype": "float32", "node_def": {"name": "Sub_19", "op": "Sub", "input": ["strided_slice_19", "Reshape_38"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sub_19", "inbound_nodes": [[["tf_op_layer_strided_slice_19", 0, 0, {}], ["tf_op_layer_Reshape_38", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_19", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_19", "op": "AddV2", "input": ["Reshape_39", "AddV2_19/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_AddV2_19", "inbound_nodes": [[["tf_op_layer_Reshape_39", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "RealDiv_16", "trainable": true, "dtype": "float32", "node_def": {"name": "RealDiv_16", "op": "RealDiv", "input": ["Sub_16", "AddV2_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_RealDiv_16", "inbound_nodes": [[["tf_op_layer_Sub_16", 0, 0, {}], ["tf_op_layer_AddV2_16", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "RealDiv_18", "trainable": true, "dtype": "float32", "node_def": {"name": "RealDiv_18", "op": "RealDiv", "input": ["Sub_18", "AddV2_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_RealDiv_18", "inbound_nodes": [[["tf_op_layer_Sub_18", 0, 0, {}], ["tf_op_layer_AddV2_18", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "RealDiv_17", "trainable": true, "dtype": "float32", "node_def": {"name": "RealDiv_17", "op": "RealDiv", "input": ["Sub_17", "AddV2_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_RealDiv_17", "inbound_nodes": [[["tf_op_layer_Sub_17", 0, 0, {}], ["tf_op_layer_AddV2_17", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "RealDiv_19", "trainable": true, "dtype": "float32", "node_def": {"name": "RealDiv_19", "op": "RealDiv", "input": ["Sub_19", "AddV2_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_RealDiv_19", "inbound_nodes": [[["tf_op_layer_Sub_19", 0, 0, {}], ["tf_op_layer_AddV2_19", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Transpose_32", "trainable": true, "dtype": "float32", "node_def": {"name": "Transpose_32", "op": "Transpose", "input": ["RealDiv_16", "Transpose_32/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, "constants": {"1": [0, 2, 1]}}, "name": "tf_op_layer_Transpose_32", "inbound_nodes": [[["tf_op_layer_RealDiv_16", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Transpose_36", "trainable": true, "dtype": "float32", "node_def": {"name": "Transpose_36", "op": "Transpose", "input": ["RealDiv_18", "Transpose_36/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0, 2, 1]}}, "name": "tf_op_layer_Transpose_36", "inbound_nodes": [[["tf_op_layer_RealDiv_18", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Transpose_34", "trainable": true, "dtype": "float32", "node_def": {"name": "Transpose_34", "op": "Transpose", "input": ["RealDiv_17", "Transpose_34/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, "constants": {"1": [0, 2, 1]}}, "name": "tf_op_layer_Transpose_34", "inbound_nodes": [[["tf_op_layer_RealDiv_17", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Transpose_38", "trainable": true, "dtype": "float32", "node_def": {"name": "Transpose_38", "op": "Transpose", "input": ["RealDiv_19", "Transpose_38/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0, 2, 1]}}, "name": "tf_op_layer_Transpose_38", "inbound_nodes": [[["tf_op_layer_RealDiv_19", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softmax_16", "trainable": true, "dtype": "float32", "node_def": {"name": "Softmax_16", "op": "Softmax", "input": ["Transpose_32"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softmax_16", "inbound_nodes": [[["tf_op_layer_Transpose_32", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softmax_18", "trainable": true, "dtype": "float32", "node_def": {"name": "Softmax_18", "op": "Softmax", "input": ["Transpose_36"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softmax_18", "inbound_nodes": [[["tf_op_layer_Transpose_36", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softmax_17", "trainable": true, "dtype": "float32", "node_def": {"name": "Softmax_17", "op": "Softmax", "input": ["Transpose_34"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softmax_17", "inbound_nodes": [[["tf_op_layer_Transpose_34", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Softmax_19", "trainable": true, "dtype": "float32", "node_def": {"name": "Softmax_19", "op": "Softmax", "input": ["Transpose_38"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Softmax_19", "inbound_nodes": [[["tf_op_layer_Transpose_38", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Transpose_33", "trainable": true, "dtype": "float32", "node_def": {"name": "Transpose_33", "op": "Transpose", "input": ["Softmax_16", "Transpose_33/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, "constants": {"1": [0, 2, 1]}}, "name": "tf_op_layer_Transpose_33", "inbound_nodes": [[["tf_op_layer_Softmax_16", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Transpose_37", "trainable": true, "dtype": "float32", "node_def": {"name": "Transpose_37", "op": "Transpose", "input": ["Softmax_18", "Transpose_37/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0, 2, 1]}}, "name": "tf_op_layer_Transpose_37", "inbound_nodes": [[["tf_op_layer_Softmax_18", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Transpose_35", "trainable": true, "dtype": "float32", "node_def": {"name": "Transpose_35", "op": "Transpose", "input": ["Softmax_17", "Transpose_35/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, "constants": {"1": [0, 2, 1]}}, "name": "tf_op_layer_Transpose_35", "inbound_nodes": [[["tf_op_layer_Softmax_17", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Transpose_39", "trainable": true, "dtype": "float32", "node_def": {"name": "Transpose_39", "op": "Transpose", "input": ["Softmax_19", "Transpose_39/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, "constants": {"1": [0, 2, 1]}}, "name": "tf_op_layer_Transpose_39", "inbound_nodes": [[["tf_op_layer_Softmax_19", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_766", "trainable": true, "batch_input_shape": [null, 8, 1], "dtype": "float32", "filters": 16, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_766", "inbound_nodes": [[["tf_op_layer_Transpose_33", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_770", "trainable": true, "batch_input_shape": [null, 8, 1], "dtype": "float32", "filters": 16, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_770", "inbound_nodes": [[["tf_op_layer_Transpose_37", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_768", "trainable": true, "batch_input_shape": [null, 8, 1], "dtype": "float32", "filters": 16, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_768", "inbound_nodes": [[["tf_op_layer_Transpose_35", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_772", "trainable": true, "batch_input_shape": [null, 8, 1], "dtype": "float32", "filters": 16, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_772", "inbound_nodes": [[["tf_op_layer_Transpose_39", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_767", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_767", "inbound_nodes": [[["conv1d_766", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_771", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_771", "inbound_nodes": [[["conv1d_770", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_769", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_769", "inbound_nodes": [[["conv1d_768", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_773", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_773", "inbound_nodes": [[["conv1d_772", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_32", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_32", "inbound_nodes": [[["conv1d_767", 0, 0, {}], ["conv1d_771", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_33", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_33", "inbound_nodes": [[["conv1d_769", 0, 0, {}], ["conv1d_767", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_34", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_34", "inbound_nodes": [[["conv1d_769", 0, 0, {}], ["conv1d_773", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_35", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_35", "inbound_nodes": [[["conv1d_771", 0, 0, {}], ["conv1d_769", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_36", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_36", "inbound_nodes": [[["conv1d_773", 0, 0, {}], ["conv1d_767", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_37", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_37", "inbound_nodes": [[["conv1d_773", 0, 0, {}], ["conv1d_771", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_774", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_774", "inbound_nodes": [[["concatenate_32", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_786", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_786", "inbound_nodes": [[["concatenate_33", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_798", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_798", "inbound_nodes": [[["concatenate_34", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_810", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_810", "inbound_nodes": [[["concatenate_35", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_822", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_822", "inbound_nodes": [[["concatenate_36", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_834", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_834", "inbound_nodes": [[["concatenate_37", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_775", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_775", "inbound_nodes": [[["conv1d_774", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_787", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_787", "inbound_nodes": [[["conv1d_786", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_799", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_799", "inbound_nodes": [[["conv1d_798", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_811", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_811", "inbound_nodes": [[["conv1d_810", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_823", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_823", "inbound_nodes": [[["conv1d_822", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_835", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_835", "inbound_nodes": [[["conv1d_834", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_777", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_777", "inbound_nodes": [[["conv1d_775", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_789", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_789", "inbound_nodes": [[["conv1d_787", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_801", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_801", "inbound_nodes": [[["conv1d_799", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_813", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_813", "inbound_nodes": [[["conv1d_811", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_825", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_825", "inbound_nodes": [[["conv1d_823", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_837", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_837", "inbound_nodes": [[["conv1d_835", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_672", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_672", "inbound_nodes": [[["conv1d_777", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_682", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_682", "inbound_nodes": [[["conv1d_789", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_692", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_692", "inbound_nodes": [[["conv1d_801", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_702", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_702", "inbound_nodes": [[["conv1d_813", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_712", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_712", "inbound_nodes": [[["conv1d_825", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_722", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_722", "inbound_nodes": [[["conv1d_837", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_800", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_800", "inbound_nodes": [[["batch_normalization_672", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_812", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_812", "inbound_nodes": [[["batch_normalization_682", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_824", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_824", "inbound_nodes": [[["batch_normalization_692", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_836", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_836", "inbound_nodes": [[["batch_normalization_702", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_848", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_848", "inbound_nodes": [[["batch_normalization_712", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_860", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_860", "inbound_nodes": [[["batch_normalization_722", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_778", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_778", "inbound_nodes": [[["activation_800", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_790", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_790", "inbound_nodes": [[["activation_812", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_802", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_802", "inbound_nodes": [[["activation_824", 0, 0, {}]]]}, {"class_name": 